Repository: Prahalad34/EnergyBunker
Catalog: lib/l10n/app_*.arb
Languages: ca, es

source: Login
ca: Iniciar sessió
es: Iniciar sesión

# accessToThePriceRoom
source: Access the best offers
ca: Accediu a les millors ofertes
es: Accede a las mejores ofertas

# toEnterThePriceRoomYouMustBeRegistered
source: Log in to your account to place your order easily
ca: Inicieu sessió al vostre compte per fer la vostra comanda fàcilment
es: Inicie sesión en su cuenta para realizar su pedido fácilmente

source: Enter your Email
ca: Introdueix el teu correu electrònic
es: Introduce tu correo electrónico

source: Enter your password
ca: Introdueix la teva contrasenya
es: Introduce tu contraseña

source: Forget Password
ca: Has oblidat la contrasenya
es: Olvidaste tu contraseña

# dontHaveAccount
source: Don't have an account?
ca: No tens un compte?
es: No tienes una cuenta?

source: Register
ca: Registrar-se
es: Regístrate

source: select language
ca: selecciona lidioma
es: Seleccionar idioma

source: LogOut
ca: Tancar sessió
es: Cerrar sesión

source: Postal code
ca: Codi postal
es: Código postal

source: Product
ca: Producte
es: Producto

source: Liters
ca: Litres
es: Litros

# selected
source: Select
ca: Selecciona
es: Seleccionar

source: Next
ca: Següent
es: Siguiente

# you
source: You are seeing the prices with VAT and transportation included that correspond to the liter range of
ca: Estàs veient els preus amb IVA i transport inclòs que corresponen al rang de litres de
es: Estás viendo los precios con IVA y transporte incluidos que corresponden al rango de litros de

# account
source: My account
ca: El meu compte
es: Mi cuenta

# fill
source: Fill out the remaining fields to complete registration and place orders
ca: Omple els camps restants per completar el registre i realitzar comandes
es: Rellena los campos restantes para completar el registro y realizar pedidos

# company
source: It`s a company
ca: És una empresa
es: Es una empresa

# make
source: place order
ca: feu la comanda
es: realizar pedido

# payment
source: Payment on delivery
ca: Pagament en efectiu a l’entrega
es: Pago contra reembolso

# companyName
source: Company name (Required if it is a company
ca: Nom de l’empresa (Obligatori si és una empresa)
es: Nombre de la empresa (Obligatorio si es una empresa)

# cif
source: CIF (Mandatory if you are a company)
ca: CIF (Obligatori si ets una empresa)
es: CIF (Obligatorio si eres una empresa)

source: Name
ca: Nom
es: Nombre

source: Surname
ca: Cognom
es: Apellido

# lastName
source: Second last name (Required if you have a second last name)
ca: Segon cognom (Obligatori si tens un segon cognom)
es: Segundo apellido (Obligatorio si tienes un segundo apellido)

source: Phone
ca: Telèfon
es: Teléfono

# tele
source: Alternative telephone
ca: Telèfon alternatiu
es: Teléfono alternativo

source: Address
ca: Adreça
es: Dirección

source: Urbanization
ca: Urbanització
es: Urbanización

# how
source: How did you know us?
ca: Com ens vas conèixer?
es: ¿Cómo nos conociste?

# offers
source: I want to join the list and receive exclusive offers.
ca: Vull unir-me a la llista i rebre ofertes exclusives.
es: Quiero unirme a la lista y recibir ofertas exclusivas.

# news
source: I want to receive advertising, news and newsletters to my email
ca: Vull rebre publicitat, notícies i butlletins per correu electrònic
es: Quiero recibir publicidad, noticias y boletines por correo electrónico

# save
source: Save Data
ca: Desar dades
es: Guardar datos

# page
source: Please review and complete the information and confirm the order at the bottom of the page
ca: Si us plau, revisa i completa la informació i confirma la comanda al final de la pàgina
es: Por favor, revisa y completa la información y confirma el pedido al final de la página

# order
source: Order details
ca: Detalls de la comanda
es: Detalles del pedido

# amount
source: Liter Amount (VAT and transportation included):
ca: Quantitat de litres (IVA i transport inclosos):
es: Cantidad de litros (IVA y transporte incluidos):

# delivery
source: Delivery details
ca: Detalls de l'entrega
es: Detalles de la entrega

source: Shift:
ca: torn
es: turno

# date
source: Delivery date:
ca: Data de lliurament:
es: Fecha de entrega:

# select
source: Select a delivery address
ca: Selecciona una adreça de lliurament
es: Selecciona una dirección de entrega

# gualavi
source: gualavi street (08292) Esparreguera
ca: carrer Gualavi (08292) Esparreguera
es: calle Gualavi (08292) Esparreguera

# biling
source: Select a billing address
ca: Selecciona una adreça de facturació
es: Selecciona una dirección de facturación

# billingAddress
source: Select default billing address
ca: Selecciona adreça de facturació per defecte
es: Selecciona dirección de facturación por defecto

# free
source: Free delivery services
ca: Serveis de lliurament gratuïts
es: Servicios de entrega gratuitos

# need
source: I need a hose longer than 20 meters
ca: Necessito una mànega de més de 20 metres
es: Necesito una manguera de más de 20 metros

# special
source: 'I need a special nozzle
ca: Necessito una boca especial
es: Necesito una boquilla especial

# notice
source: I need to be called 30 minutes before.
ca: Necessito que em truquin 30 minuts abans.
es: Necesito que me llamen 30 minutos antes.

# service
source: Delivery service with possible surcharge
ca: Servei de lliurament amb possible recàrrec
es: Servicio de entrega con posible recargo

# most
source: In most cases there are usually NO surcharges. In the event that your order has a surcharge for having requested one of our special delivery services, we will We will contact you as soon as possible to inform you of the amount of the surcharge and you can decide at that time whether to confirm the delivery of your order.
ca: En la majoria dels casos no sol haver-hi recàrrecs. Si la teva comanda té un recàrrec per haver sol·licitat un dels nostres serveis de lliurament especials, ens posarem en contacte amb tu tan aviat com sigui possible per informar-te de l'import del recàrrec i podràs decidir en aquell moment si confirmar el lliurament de la teva comanda.
es: En la mayoría de los casos no suele haber recargos. En caso de que tu pedido tenga un recargo por haber solicitado uno de nuestros servicios de entrega especiales, te contactaremos lo antes posible para informarte del importe del recargo y podrás decidir en ese momento si confirmar la entrega de tu pedido.

# discharge
source: Discharge on floors (except ground floors)
ca: Descàrrega en plantes (excepte plantes baixes)
es: Descarga en plantas (excepto en plantas bajas)

# small
source: Small truck (Capacity 6,000 liters)
ca: Camió petit (Capacitat 6.000 litres)
es: Camión pequeño (Capacidad 6,000 litros)

# truck
source: small truck (Capacity 3,000 liters)
ca: Camió petit (Capacitat 3.000 litres)
es: Camión pequeño (Capacidad 3,000 litros)

# method
source: Payment method (You don't pay anything until the day of delivery)
ca: Mètode de pagament (No pagues res fins el dia del lliurament)
es: Método de pago (No pagas nada hasta el día de la entrega.)

# responsible
source: Observations for the delivery of diesel)
ca: Observacions del lliurament de dièsel)
es: Observaciones de la entrega de diésel)

# write
source: Write your observations here
ca: Escriu les teves observacions aquí
es: Escribe tus observaciones aquí

# have
source: Deliveries are made in time slots of morning (8:00-14:00) or afternoon (14:00-17:00). You can select your preferred time, and we will do our best to accommodate you. If that is not possible, we will call you to adjust the order and find a solution.
ca: Els lliuraments es fan en franges horàries de matí (8:00-14:00) o tarda (14:00-17:00). Pots seleccionar el teu horari preferit i farem tot el possible per acomodar-te. Si això no és possible, us trucarem per ajustar la comanda i trobar una solució.
es: Las entregas se realizan en franjas horarias de mañana (8:00-14:00) o tarde (14:00-17:00). Puede seleccionar su horario preferido y haremos todo lo posible para atenderlo. Si eso no es posible, te llamaremos para ajustar el pedido y buscar una solución.

# again
source: Search prices again
ca: Cerca preus de nou
es: Buscar precios nuevamente

# confirm
source: To confirm order
ca: Confirmar comanda
es: Confirmar pedido

# dear
source: Dear customer, your order has been processed.
ca: Benvolgut client, la seva comanda s'ha processat.
es: Estimado cliente, su pedido ha sido procesado.

# email
source: You will soon receive a confirmation email. Please note that our office hours are from 9 AM to 6 PM, Monday to Friday. If we don’t confirm right away, don’t worry; our team will confirm the order as soon as possible.
ca: Aviat rebràs un correu electrònic de confirmació. Tingueu en compte que el nostre horari d'oficina és de 9:00 a 18:00, de dilluns a divendres. Si no confirmem de seguida, no us preocupeu; el nostre equip confirmarà la comanda el més aviat possible.
es: Pronto recibirás un correo electrónico de confirmación. Tenga en cuenta que nuestro horario de oficina es de 9 a. m. a 6 p. m., de lunes a viernes. Si no lo confirmamos de inmediato, no se preocupe; Nuestro equipo confirmará el pedido lo antes posible.

# room
source: Return to place an order
ca: Torna per fer una comanda
es: Volver para realizar un pedido

# sign
source: Sign up today and enjoy fast orders and exclusive offers
ca: Registra't avui i gaudeix de comandes ràpides i ofertes exclusives
es: Regístrate hoy y disfruta de pedidos rápidos y ofertas exclusivas

# enjoy
source: Register in just a few steps to access our best offers and place your order quickly and easily
ca: Registra't en pocs passos per accedir a les nostres millors ofertes i fer la teva comanda de manera ràpida i senzilla
es: Regístrate en tan solo unos pasos para acceder a nuestras mejores ofertas y realizar tu pedido de forma rápida y sencilla

# firstName
source: Enter your First name
ca: Introdueix el teu primer nom
es: Introduce tu primer nombre

# enterLast
source: Enter your last name
ca: Introdueix el teu cognom
es: Introduce tu apellido

# confirmPassword
source: Enter your confirm password
ca: Introdueix la teva contrasenya de confirmació
es: Introduce tu contraseña de confirmación

# accept
source: I have read accept the conditions of Use and the
ca: He llegit i accepto les condicions d'ús i la
es: He leído y acepto las condiciones de uso y la

# policy
source: privacy policy
ca: política de privacitat
es: política de privacidad

# an
source: Already have an account?
ca: Ja tens un compte?
es: ¿Ya tienes una cuenta?

# good
source: Sign in
ca: Inicia sessió
es: Iniciar sesión

# passwords
source: Enter your email address to rest your passwords
ca: Introdueix la teva adreça de correu electrònic per restablir tu contrasenya
es: Introduce tu dirección de correo electrónico para restablecer tu contraseña

source: Send
ca: Enviar
es: Enviar

# approved
source: Account not verified. Please verify your account through the email.
ca: Compte no verificat. Verifiqueu el vostre compte mitjançant el correu electrònic.
es: Cuenta no verificada. Por favor verifique su cuenta a través del correo electrónico.

source: OK
ca: Dacord
es: Está bien

# automotive
source: Diesel fuel for automotive use
ca: Combustible dièsel per a ús automotor
es: Combustible diésel para uso automotriz

# agricultural
source: Diesel fuel for heating and agricultural use
ca: Combustible dièsel per a calefacció i ús agrícola
es: Combustible diésel para calefacción y uso agrícola

# morning
source: Morning delivery
ca: Entrega del matí
es: Entrega de la mañana

# afternoon
source: Afternoon delivery
ca: Entrega de la tarda
es: Entrega de la tarde

source: press
ca: premeu
es: presionar

source: pressed
ca: premut
es: presionado

source: Cash
ca: Efectiu
es: efectivo

# online
source: Credit Card
ca: Targeta de crèdit
es: Tarjeta de crédito

# delete
source: Account Delete
ca: Eliminar compte
es: Eliminar cuenta

source: Yes
ca: Sí
es: Sí

source: lts
ca: Anem a
es: Vamos a

# quantity
source: Quantity-Start (L)
ca: Quantitat-Inici (L)
es: Cantidad-Inicio (L)

# quantityend
source: Quantity-End (L)
ca: Quantitat-Final (L)
es: Cantidad-Final (L)

# discountpercent
source: Discount(%)
ca: Descompte(%)
es: Descuento(%)

source: Petrol
ca: Gasolina
es: Gasolina

source: Diesel
ca: Dièsel
es: Diésel

# discountappbar
source: Discount
ca: Descompte
es: Descuento

source: Total Amount:
ca: Quantitat Total:
es: Cantidad Total:

source: After Discount Amount:
ca: Quantitat Després del Descompte:
es: Cantidad Después del Descuento:

# desiscount
source: Discount:
ca: Descompte:
es: Descuento:

source: Discount Offer
ca: Oferta de descompte
es: Oferta de descuento

# morningitem
source: morning
ca: matí
es: mañana

# afternoonitem
source: afternoon
ca: tarda
es: tarde

# automot
source: Automotive
ca: Automoció
es: automotora

# agricultu
source: Agricultural
es: Agrícola
